### ใช้ for loop เพื่อพิมพ์สามเหลี่ยมดังรูปด้านล่าง ให้ผู้ใช้ระบุได้ว่าสูงแค่ไหน
### *
### **
### ***
### ****


# รับความสูงของสามเหลี่ยมจากผู้ใช้
height = int(input("ป้อนความสูงของสามเหลี่ยม: "))
##### อีกด้าน #####
# พิมพ์สามเหลี่ยมดาว
## for i in range(height):
## # พิมพ์ช่องว่างก่อนหน้า
##  for j in range(i + 1):
##    print("*", end="")
####  # พิมพ์บรรทัดใหม่
##  print()

# พิมพ์สามเหลี่ยมดาว
for i in range(height):
  # พิมพ์ดาวก่อนหน้า
  for j in range(i + 1):
    print("*", end="")

  # พิมพ์ช่องว่าง
  for j in range(height - i - 1):
    print(" ", end="")

  # พิมพ์บรรทัดใหม่
  print()
