# บรรทัดแรกเหมือนกับเราเอาเลข 5 ใส่ลงไปในกล่อง "numeric1"
numeric1 = 5

# บรรทัดนี้เหมือนกับเราเปิดกล่อง "numeric1" ดูว่าข้างในมีอะไร ผลลัพธ์ที่ได้คือ 5 เพราะว่าเราใส่ตัวเลข 5 ไว้ในกล่อง
print(numeric1) 

# บรรทัดนี้เหมือนกับว่าเราหยิบของในกล่อง "numeric1" ไปให้กล่อง "type" ตรวจสอบว่าของชิ้นนั้นเป็นอะไร ผลลัพธ์ที่ได้คือ <class 'int'> 
# หมายความว่าของชิ้นนั้นเป็น จำนวนเต็ม (integer)
print(type(numeric1))

## โปรแกรมนี้แสดงตัวอย่างการกำหนดค่าให้ตัวแปรและแสดงผลชนิดข้อมูลของตัวแปร (เหมือนเรามีกล่องใส่ของไว้เก็บตัวเลขและตรวจสอบชนิดของตัวเลข)

### 5
### <class 'int'>